Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.10.212/samv70b/atdf/ATSAMV70J19B.atdf
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PD30" function="X1" group="AD" index="0"/>
              <signal pad="PA21" function="X1" group="AD" index="1"/>
              <signal pad="PB3" function="X1" group="AD" index="2"/>
              <signal pad="PB2" function="X1" group="AD" index="5"/>
              <signal pad="PA17" function="X1" group="AD" index="6"/>
              <signal pad="PA18" function="X1" group="AD" index="7"/>
              <signal pad="PA19" function="X1" group="AD" index="8"/>
              <signal pad="PA20" function="X1" group="AD" index="9"/>
              <signal pad="PB0" function="X1" group="AD" index="10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param caption="External ADC Trigger Input (AFE0_ADTRG pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC0 Channel 0 Output (TIOA0)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC0 Channel 1 Output (TIOA1)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC0 Channel 2 Output (TIOA2)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM0 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM0 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
              <param caption="Temperature Sensor Channel" name="TEMP_SENSOR_CH_NUM" value="11"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="ADTRG"/>
              <signal pad="PB1" function="X1" group="AD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
              <param caption="External ADC Trigger Input (AFE1_ADTRG Pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC1 Channel 0 Output (TIOA3)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC1 Channel 1 Output (TIOA4)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC1 Channel 2 Output (TIOA5)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM1 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM1 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="E">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_CH0_TX" value="30"/>
              <param name="DMAC_ID_CH1_TX" value="31"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="Y">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="ICM" id="11105" version="H">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="K">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="D" index="0"/>
              <signal pad="PD21" function="D" group="D" index="1"/>
              <signal pad="PB3" function="D" group="D" index="2"/>
              <signal pad="PA9" function="B" group="D" index="3"/>
              <signal pad="PA5" function="B" group="D" index="4"/>
              <signal pad="PD11" function="D" group="D" index="5"/>
              <signal pad="PD12" function="D" group="D" index="6"/>
              <signal pad="PA27" function="D" group="D" index="7"/>
              <signal pad="PD27" function="D" group="D" index="8"/>
              <signal pad="PD28" function="D" group="D" index="9"/>
              <signal pad="PD30" function="D" group="D" index="10"/>
              <signal pad="PD31" function="D" group="D" index="11"/>
              <signal pad="PD24" function="D" group="HSYNC"/>
              <signal pad="PA24" function="D" group="PCK"/>
              <signal pad="PD25" function="D" group="VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="L">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
