Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.10.212/samv70b/atdf/ATSAMV70J19B.atdf
    <module name="FPB" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x10000000" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1"/>
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2"/>
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0"/>
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00"/>
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000"/>
          <bitfield name="REV" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0"/>
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000"/>
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="8" initval="0x00000000" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT"/>
          <mode name="DEFAULT"/>
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1"/>
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC"/>
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000"/>
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE"/>
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FP_LAR__KEY"/>
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="FP_PID4" offset="0xFD0" rw="R" size="4" access-size="4" initval="0x00000004" caption="FP Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="FP_PID5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 5">
        </register>
        <register name="FP_PID6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 6">
        </register>
        <register name="FP_PID7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 7">
        </register>
        <register name="FP_PID0" offset="0xFE0" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="FP_PID1" offset="0xFE4" rw="R" size="4" access-size="4" initval="0x000000B0" caption="FP Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="FP_PID2" offset="0xFE8" rw="R" size="4" access-size="4" initval="0x0000002B" caption="FP Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="FP_PID3" offset="0xFEC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="FP_CID0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="FP Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CID1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x000000E0" caption="FP Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="FP_CID2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="FP Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CID3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="FP Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="FP_LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="CoreDebug" caption="Core Debug Register">
      <register-group name="CoreDebug" caption="Core Debug Register">
        <register name="DHCSR" offset="0xF0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="" mask="0x1"/>
          <bitfield name="C_HALT" caption="" mask="0x2"/>
          <bitfield name="C_STEP" caption="" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="" mask="0x8"/>
          <bitfield name="C_SNAPSTALL" caption="" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="" mask="0x10000"/>
          <bitfield name="S_HALT" caption="" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="" mask="0x80000"/>
          <bitfield name="S_RETIRE_ST" caption="" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="" mask="0x2000000"/>
        </register>
        <register name="DCRSR" offset="0xF4" rw="W" size="4" access-size="4" caption="Debug Core Register Selector Register">
          <bitfield name="REGSEL" caption="" mask="0x1F"/>
          <bitfield name="REGWnR" caption="" mask="0x10000"/>
        </register>
        <register name="DCRDR" offset="0xF8" rw="RW" size="4" access-size="4" caption="Debug Core Register Data Register">
        </register>
        <register name="DEMCR" offset="0xFC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="" mask="0x400"/>
          <bitfield name="MON_EN" caption="" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="" mask="0x80000"/>
          <bitfield name="TRCENA" caption="" mask="0x1000000"/>
        </register>
      </register-group>
    </module>
